tests/profile-service-01/faults/internalServerError/4_queryPackageList

POST /profile/service.php HTTP/1.1
Host: localhost:8888
User-Agent: Axis2C/1.6.0
SOAPAction: "/queryPackageList"
Content-Length: 373
Content-Type: text/xml;charset=UTF-8

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><n:queryPackageList xsi:type="queryPackageListType" xmlns:xsi="http://www.pratsam.org/ns/profile/" xmlns:n="http://www.pratsam.org/ns/profile/"><n:firmwareType>Type</n:firmwareType><n:firmwareVersion>Version</n:firmwareVersion></n:queryPackageList></soapenv:Body></soapenv:Envelope>

HTTP/1.1 500 Internal Service Error
Date: Thu, 08 Sep 2011 12:44:19 GMT
Server: Apache/2.2.9 (Debian) PHP/5.2.6-1+lenny13 with Suhosin-Patch mod_ssl/2.2.9 OpenSSL/0.9.8g mod_perl/2.0.4 Perl/v5.10.0
X-Powered-By: PHP/5.2.6-1+lenny13
Cache-Control: no-store, no-cache, must-revalidate, post-check=0, pre-check=0
Pragma: no-cache
Content-Length: 408
Content-Type: text/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.pratsam.org/ns/profile/"><SOAP-ENV:Body><SOAP-ENV:Fault><faultcode>SOAP-ENV:Server</faultcode><faultstring>Internal Server Error</faultstring><faultactor></faultactor><detail><ns1:internalServerErrorFault/></detail></SOAP-ENV:Fault></SOAP-ENV:Body></SOAP-ENV:Envelope>
